{
  "menuitem1": "Sobre de mí",
  "menuitem2": "Proyectos",
  "menuitem3": "Habilidades",
  "menuitem4": "Contacto",

  "charge": "Ingeniero de Sistemas",
  "OpenToWork": "Abierto a trabajar",
  "CloseToWork": "No disponible",
  "Resume": "Currículum",

  "professionalTitle": "👨‍💻 Perfil Profesional",
  "professionalPosition_1": "Desarrollador Full Stack - Roxvan SAS",
  "professionalDescription_1": "Contribuí al desarrollo de Go-Cal, un software de gestión metrológica optimizado para la calibración y mantenimiento de equipos, garantizando el cumplimiento de la norma ISO 17025. Diseñé interfaces interactivas con React y TypeScript, optimicé bases de datos en PostgreSQL, desarrollé microservicios con Node.js y Python, e implementé despliegues automatizados con Docker. Además, lideré revisiones de código en GitHub, mejorando la calidad y fiabilidad del software.",
  "professionalPosition_2": "Desarrollador Full Stack (Freelance) - Pro-Barranquilla",
  "professionalDescription_2": "Desarrollé un simulador de impuestos para comerciantes y emprendedores, automatizando cálculos fiscales y generando informes en PDF. Implementé el backend con Node.js, Express, TypeScript, Prisma ORM y MongoDB, con autenticación JWT y notificaciones por correo. Creé una interfaz dinámica con React, Vite y Ant Design, y desarrollé un panel administrativo para gestionar tarifas e indicadores económicos. Documenté el proyecto con manual técnico y diagramas, asegurando claridad en el diseño e implementación.",
  "professionalPosition_3": "Desarrollador Full Stack - Infinity Tech Consulting",
  "professionalDescription_3": "Trabajo en el desarrollo de los servicios y de las aplicaciones web y móviles de Lorry, una plataforma diseñada para optimizar la gestión de flotas de buses y camiones. Me enfoco en crear arquitecturas backend escalables con Node.js y TypeScript, mejorar el rendimiento y la eficiencia de las consultas en PostgreSQL y fortalecer la seguridad y robustez en la generación de reportes. Gracias a mis aportes, los tiempos de carga del sistema han disminuido, los procesos críticos operan con mayor estabilidad y las aplicaciones cuentan ahora con una estandarización sólida en sus patrones de diseño, facilitando su escalabilidad y mantenimiento.",
  "present": "Actualidad",

  "aboutTitle": "📌 Perfil",
  "aboutInfo_1": "Hola 👋, soy ingeniero de sistemas con experiencia en",
  "aboutInfo_1_span": " desarrollo backend y bases de datos.",
  "aboutInfo_2": " Me especializo en JavaScript, TypeScript, Node.js y bases de datos como PostgreSQL, SQL y MongoDB. También tengo conocimientos en tecnologías frontend como React y Next.js.",
  "aboutInfo_3": " Disfruto resolviendo problemas complejos y siempre estoy",
  "aboutInfo_3_span": " buscando oportunidades como desarrollador backend",
  "aboutInfo_4": " en proyectos desafiantes e innovadores.",

  "projectTitle": "🚀 Proyectos",
  "projectInfo_1": "Es una plataforma para comprar dispositivos electrónicos donde los usuarios gestionan el stock mediante compras o eliminaciones. El administrador actualiza el inventario para una experiencia óptima.",
  "projectInfo_2": "Plataforma con recetas personalizadas, panel de control para análisis y estilo intuitivo para usuarios y administradores. Beneficios: mayor participación, mejores decisiones y satisfacción del cliente.",
  "projectInfo_3": "La aplicación web Conéctate e interactúa con tu comunidad eclesiástica a través de nuestra plataforma web. Crea foros y publicaciones, fomentando la interacción y discusiones entre miembros, promoviendo una congregación en línea vibrante.",
  "projectInfo_4": "Una plataforma web ofrece simuladores interactivos para la cinemática y las leyes de Newton. Los usuarios ingresan valores de estudio para generar animaciones gráficas y ver resultados detallados en tablas, proporcionando una experiencia educativa e intuitiva.",
  "projectInfo_5": "Explora a los mejores atletas y deportes categorizados por tipo en nuestra plataforma. Descubre lo mejor de cada categoría y sugiere nuevos deportes para expandir nuestra cobertura.",
  "projectInfo_6": "Crea tu propio árbol binario de manera interactiva en nuestra plataforma. Una vez construido, explora varios recorridos del árbol, examina nodos hoja y verifica si el árbol está completo.",

  "loadMore": "Cargar Más",
  "loadLess": "Cargar Menos",

  "publisher": "Editorial",

  "research_and_presentationsTitle": "🔍 Investigaciones y Presentaciones",

  "skillsTitle": "🎯 Habilidades",

  "contactTitle": "📩 Contacto",
  "contactlabel1": "correo electrónico",
  "contactlabel2": "mensaje",
  "contactbtn": "Enviar correo electrónico",

  "toastLoading": "Enviando correo...",
  "toastSucces": "Correo enviado con éxito",
  "toastError": "Error al enviar el correo",

  "emailerrormsg1": "Por favor, introduce tu correo electrónico",
  "emailerrormsg2": "El correo electrónico es demasiado largo",
  "emailerrormsg3": "Por favor, introduce una dirección de correo electrónico válida",

  "messageerrormsg1": "Por favor, envíame un mensaje",

  "footer": "Desarrollado por",

  "ChangeLenguage": "Cambiar Idioma",
  "ChangeTheme": "Cambiar Tema",
  "BackTop": "Volver Arriba",
  "SeePage": "Click para ver el proyecto"
}
