{
  "menuitem1": "Sobre de m칤",
  "menuitem2": "Proyectos",
  "menuitem3": "Habilidades",
  "menuitem4": "Contacto",

  "charge": "Desarrollador Full Stack",
  "OpenToWork": "Abierto a trabajar",
  "CloseToWork": "No disponible",
  "Resume": "Curr칤culum",

  "aboutTitle": "游늷 Acerca de m칤",
  "aboutInfo_1": "Hola 游녦, soy estudiante de ingenier칤a de sistemas apasionado por",
  "aboutInfo_1_span": " el desarrollo web moderno.",
  "aboutInfo_2": " Me especializo en React y Node.js, y me encanta explorar diferentes tecnolog칤as. Disfruto resolviendo problemas y siempre estoy",
  "aboutInfo_2_span": " buscando nuevos desaf칤os",
  "aboutInfo_3": " en el mundo de la tecnolog칤a. Me encantar칤a formar parte de proyectos emocionantes y seguir aprendiendo.",

  "projectTitle": "游 Proyectos",
  "projectInfo_1": "Es una plataforma para comprar dispositivos electr칩nicos donde los usuarios gestionan el stock mediante compras o eliminaciones. El administrador actualiza el inventario para una experiencia 칩ptima.",
  "projectInfo_2": "Plataforma con recetas personalizadas, panel de control para an치lisis y estilo intuitivo para usuarios y administradores. Beneficios: mayor participaci칩n, mejores decisiones y satisfacci칩n del cliente.",
  "projectInfo_3": "La aplicaci칩n web Con칠ctate e interact칰a con tu comunidad eclesi치stica a trav칠s de nuestra plataforma web. Crea foros y publicaciones, fomentando la interacci칩n y discusiones entre miembros, promoviendo una congregaci칩n en l칤nea vibrante.",
  "projectInfo_4": "Una plataforma web ofrece simuladores interactivos para la cinem치tica y las leyes de Newton. Los usuarios ingresan valores de estudio para generar animaciones gr치ficas y ver resultados detallados en tablas, proporcionando una experiencia educativa e intuitiva.",
  "projectInfo_5": "Explora a los mejores atletas y deportes categorizados por tipo en nuestra plataforma. Descubre lo mejor de cada categor칤a y sugiere nuevos deportes para expandir nuestra cobertura.",
  "projectInfo_6": "Crea tu propio 치rbol binario de manera interactiva en nuestra plataforma. Una vez construido, explora varios recorridos del 치rbol, examina nodos hoja y verifica si el 치rbol est치 completo.",

  "skillsTitle": "游꿢 Habilidades",

  "contactTitle": "游닐 Contacto",
  "contactlabel1": "correo electr칩nico",
  "contactlabel2": "mensaje",
  "contactbtn": "Enviar correo electr칩nico",

  "toastLoading": "Enviando correo...",
  "toastSucces": "Correo enviado con 칠xito",
  "toastError": "Error al enviar el correo",

  "emailerrormsg1": "Por favor, introduce tu correo electr칩nico",
  "emailerrormsg2": "El correo electr칩nico es demasiado largo",
  "emailerrormsg3": "Por favor, introduce una direcci칩n de correo electr칩nico v치lida",

  "messageerrormsg1": "Por favor, env칤ame un mensaje",

  "footer": "Desarrollado por",

  "ChangeLenguage": "Cambiar Idioma",
  "ChangeTheme": "Cambiar Tema",
  "BackTop": "Volver Arriba"
}
