{
  "menuitem1": "Sobre de mí",
  "menuitem2": "Proyectos",
  "menuitem3": "Habilidades",
  "menuitem4": "Contacto",

  "charge": "Desarrollador Full Stack",
  "OpenToWork": "Abierto a trabajar",
  "CloseToWork": "No disponible",
  "Resume": "Currículum",

  "professionalTitle": "👨‍💻 Perfil Profesional",
  "professionalPosition_1": "Desarrollador de Software",
  "professionalDescription_1": "Diseñé y desarrollé interfaces de usuario interactivas con React y TypeScript, optimizando la experiencia del usuario. Gestioné y optimicé bases de datos PostgreSQL para mejorar el rendimiento y la escalabilidad. Creé y mantuve microservicios y APIs RESTful con Python y Node.js, implementando y desplegando aplicaciones en entornos Docker para garantizar eficiencia y consistencia. Además, administré el control de versiones con Git y GitHub, colaborando en revisiones de código para asegurar su calidad e integridad.",
  "professionalPosition_2": "Desarrollador de Software (Freelance)",
  "professionalDescription_2": "Diseñé y desarrollé un simulador financiero con un módulo administrativo para la gestión de tarifas, configuración y administración de usuarios. Implementé el backend con Node.js, Express, TypeScript, Prisma ORM y MongoDB, incorporando JWT para autenticación, Nodemailer (SMTP) para notificaciones y Puppeteer para generación de documentos. Desarrollé una interfaz de usuario dinámica y eficiente con React, Vite, TypeScript, Zustand, Ant Design, Bootstrap y Axios. Además, documenté el proyecto con un manual técnico, incluyendo diagramas de base de datos, arquitectura y secuencia. Gestioné el control de versiones y la colaboración a través de Git y GitHub.",
  "present": "Actualidad",

  "aboutTitle": "📌 Acerca de mí",
  "aboutInfo_1": "Hola 👋, soy estudiante de ingeniería de sistemas apasionado por",
  "aboutInfo_1_span": " el desarrollo web moderno.",
  "aboutInfo_2": " Me especializo en React y Node.js, y me encanta explorar diferentes tecnologías. Disfruto resolviendo problemas y siempre estoy",
  "aboutInfo_2_span": " buscando nuevos desafíos",
  "aboutInfo_3": " en el mundo de la tecnología. Me encantaría formar parte de proyectos emocionantes y seguir aprendiendo.",

  "projectTitle": "🚀 Proyectos",
  "projectInfo_1": "Es una plataforma para comprar dispositivos electrónicos donde los usuarios gestionan el stock mediante compras o eliminaciones. El administrador actualiza el inventario para una experiencia óptima.",
  "projectInfo_2": "Plataforma con recetas personalizadas, panel de control para análisis y estilo intuitivo para usuarios y administradores. Beneficios: mayor participación, mejores decisiones y satisfacción del cliente.",
  "projectInfo_3": "La aplicación web Conéctate e interactúa con tu comunidad eclesiástica a través de nuestra plataforma web. Crea foros y publicaciones, fomentando la interacción y discusiones entre miembros, promoviendo una congregación en línea vibrante.",
  "projectInfo_4": "Una plataforma web ofrece simuladores interactivos para la cinemática y las leyes de Newton. Los usuarios ingresan valores de estudio para generar animaciones gráficas y ver resultados detallados en tablas, proporcionando una experiencia educativa e intuitiva.",
  "projectInfo_5": "Explora a los mejores atletas y deportes categorizados por tipo en nuestra plataforma. Descubre lo mejor de cada categoría y sugiere nuevos deportes para expandir nuestra cobertura.",
  "projectInfo_6": "Crea tu propio árbol binario de manera interactiva en nuestra plataforma. Una vez construido, explora varios recorridos del árbol, examina nodos hoja y verifica si el árbol está completo.",

  "loadMore": "Cargar Más",
  "loadLess": "Cargar Menos",

  "publisher": "Editorial",

  "research_and_presentationsTitle": "🔍 Investigaciones y Presentaciones",

  "skillsTitle": "🎯 Habilidades",

  "contactTitle": "📩 Contacto",
  "contactlabel1": "correo electrónico",
  "contactlabel2": "mensaje",
  "contactbtn": "Enviar correo electrónico",

  "toastLoading": "Enviando correo...",
  "toastSucces": "Correo enviado con éxito",
  "toastError": "Error al enviar el correo",

  "emailerrormsg1": "Por favor, introduce tu correo electrónico",
  "emailerrormsg2": "El correo electrónico es demasiado largo",
  "emailerrormsg3": "Por favor, introduce una dirección de correo electrónico válida",

  "messageerrormsg1": "Por favor, envíame un mensaje",

  "footer": "Desarrollado por",

  "ChangeLenguage": "Cambiar Idioma",
  "ChangeTheme": "Cambiar Tema",
  "BackTop": "Volver Arriba",
  "SeePage": "Click para ver el proyecto"
}
