{
  "menuitem1": "About Me",
  "menuitem2": "Projects",
  "menuitem3": "Skills",
  "menuitem4": "Contact",

  "charge": "System Engineer",
  "OpenToWork": "Open to work",
  "CloseToWork": "Not available",
  "Resume": "Resume",

  "professionalTitle": "👨‍💻 Professional Profile",
  "professionalPosition_1": "Full Stack Developer - Roxvan SAS",
  "professionalDescription_1": "Contributed to the development of Go-Cal, a metrological management software optimized for the calibration and maintenance of equipment, ensuring compliance with ISO 17025. Designed interactive interfaces with React and TypeScript, optimized databases in PostgreSQL, developed microservices with Node.js and Python, and implemented automated deployments with Docker. Additionally, led code reviews on GitHub, improving software quality and reliability.",
  "professionalPosition_2": "Full Stack Developer (Freelance) - Pro-Barranquilla",
  "professionalDescription_2": "Developed a tax simulator for merchants and entrepreneurs, automating tax calculations and generating PDF reports. Implemented the backend with Node.js, Express, TypeScript, Prisma ORM, and MongoDB, with JWT authentication and email notifications. Created a dynamic interface with React, Vite, and Ant Design, and developed an administrative panel to manage rates and economic indicators. Documented the project with a technical manual and diagrams, ensuring clarity in design and implementation.",
  "present": "Present",

  "aboutTitle": "📌 Profile",
  "aboutInfo_1": "Hello 👋, I am a systems engineer with experience in",
  "aboutInfo_1_span": " backend development and databases.",
  "aboutInfo_2": " I specialize in JavaScript, TypeScript, Node.js, and databases such as PostgreSQL, SQL, and MongoDB. I also have knowledge in frontend technologies like React and Next.js.",
  "aboutInfo_3": " I enjoy solving complex problems and am always",
  "aboutInfo_3_span": " looking for opportunities as a backend developer",
  "aboutInfo_4": " in challenging and innovative projects.",

  "projectTitle": "🚀 Projects",
  "projectInfo_1": "It's a platform for buying electronic devices where users manage stock through purchases or deletions. The administrator updates inventory for an optimal shopping experience.",
  "projectInfo_2": "Platform with personalized recipes, dashboard for analysis, and intuitive style for both users and administrators. Benefits include increased engagement, better decision-making, and customer satisfaction.",
  "projectInfo_3": "The web application Connect and engage with your church community through our web platform. Create forums and posts, encouraging interaction and discussions among members, fostering a vibrant online congregation.",
  "projectInfo_4": "A web platform offers interactive simulators for kinematics and Newton's laws. Users input study values to generate graphic animations and view detailed results in tables, providing an educational and intuitive experience.",
  "projectInfo_5": " Browse top athletes and sports categorized by type on our platform. Discover the best in each category and suggest new sports to expand our coverage.",
  "projectInfo_6": "Create your own binary tree interactively on our platform. Once constructed, explore various tree traversals, examine leaf nodes, and check if the tree is complete.",

  "loadMore": "Load More",
  "loadLess": "Load Less",

  "publisher": "Publisher",

  "research_and_presentationsTitle": "🔍 Research and Presentations",

  "skillsTitle": "🎯 Skills",

  "contactTitle": "📩 Contact",
  "contactlabel1": "email",
  "contactlabel2": "message",
  "contactbtn": "Send email",

  "toastLoading": "Sending email...",
  "toastSucces": "Email sent successfully",
  "toastError": "Failed to send email",

  "emailerrormsg1": "Please enter your email",
  "emailerrormsg2": "The email is too long",
  "emailerrormsg3": "Please enter a valid email address",

  "messageerrormsg1": "Please send me a message",

  "footer": "Developed by",

  "ChangeLenguage": "Change Lenguage",
  "ChangeTheme": "Change Theme",
  "BackTop": "Back to Top",
  "SeePage": "Click to Whatch the Project"
}
